MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX220F032D.atdf
      <value-group caption="Positive Input Select bits for Sample B" name="AD1CHS__CH0SB">
         <value caption="Channel 0 positive input is Open" name="OPEN" value="0xf" />
         <value caption="Channel 0 positive input is IVREF" name="IVREF" value="0xe" />
         <value caption="Channel 0 positive input is CTMU temperature sensor (CTMUT)" name="CTMUT" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />

      </value-group>
      <value-group caption="Negative Input Select bit for Sample B" name="AD1CHS__CH0NB">
         <value caption="Channel 0 negative input is AN1" name="" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="" value="0x0" />
      </value-group>
      <value-group caption="AN0 Pin Scan Selection bits" name="AD1CSSL__CSSL0">
         <value caption="Select AN0 for input scan; CSSL0 = AN0" name="" value="0x1" />
         <value caption="Skip AN0 for input scan; CSSL0 = AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Pin Scan Selection bits" name="AD1CSSL__CSSL1">
         <value caption="Select AN1 for input scan; CSSL1 = AN1" name="" value="0x1" />
         <value caption="Skip AN1 for input scan; CSSL1 = AN1" name="" value="0x0" />
      </value-group>
      <value-group caption="AN2 Pin Scan Selection bits" name="AD1CSSL__CSSL2">
         <value caption="Select AN2 for input scan; CSSL2 = AN2" name="" value="0x1" />
         <value caption="Skip AN2 for input scan; CSSL2 = AN2" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Pin Scan Selection bits" name="AD1CSSL__CSSL3">
         <value caption="Select AN3 for input scan; CSSL3 = AN3" name="" value="0x1" />
         <value caption="Skip AN3 for input scan; CSSL3 = AN3" name="" value="0x0" />
      </value-group>
      <value-group caption="AN4 Pin Scan Selection bits" name="AD1CSSL__CSSL4">
         <value caption="Select AN4 for input scan; CSSL4 = AN4" name="" value="0x1" />
         <value caption="Skip AN4 for input scan; CSSL4 = AN4" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Pin Scan Selection bits" name="AD1CSSL__CSSL5">
         <value caption="Select AN5 for input scan; CSSL5 = AN5" name="" value="0x1" />
         <value caption="Skip AN5 for input scan; CSSL5 = AN5" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Pin Scan Selection bits" name="AD1CSSL__CSSL6">
         <value caption="Select AN6 for input scan; CSSL6 = AN6" name="" value="0x1" />
         <value caption="Skip AN6 for input scan; CSSL6 = AN6" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Pin Scan Selection bits" name="AD1CSSL__CSSL7">
         <value caption="Select AN7 for input scan; CSSL7 = AN7" name="" value="0x1" />
         <value caption="Skip AN7 for input scan; CSSL7 = AN7" name="" value="0x0" />
      </value-group>
      <value-group caption="AN8 Pin Scan Selection bits" name="AD1CSSL__CSSL8">
         <value caption="Select AN8 for input scan; CSSL8 = AN8" name="" value="0x1" />
         <value caption="Skip AN8 for input scan; CSSL8 = AN8" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Pin Scan Selection bits" name="AD1CSSL__CSSL9">
         <value caption="Select AN9 for input scan; CSSL9 = AN9" name="" value="0x1" />
         <value caption="Skip AN9 for input scan; CSSL9 = AN9" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Pin Scan Selection bits" name="AD1CSSL__CSSL10">
         <value caption="Select AN10 for input scan; CSSL10 = AN10" name="" value="0x1" />
         <value caption="Skip AN10 for input scan; CSSL10 = AN10" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Pin Scan Selection bits" name="AD1CSSL__CSSL11">
         <value caption="Select AN11 for input scan; CSSL11 = AN11" name="" value="0x1" />
         <value caption="Skip AN11 for input scan; CSSL11 = AN11" name="" value="0x0" />
      </value-group>
      <value-group caption="AN12 Pin Scan Selection bits" name="AD1CSSL__CSSL12">
         <value caption="Select AN12 for input scan; CSSL12 = AN12" name="" value="0x1" />
         <value caption="Skip AN12 for input scan; CSSL12 = AN12" name="" value="0x0" />
      </value-group>
      <value-group caption="CTMUI Pin Scan Selection bits" name="AD1CSSL__CSSL13">
         <value caption="Select CTMUI for input scan; CSSL13 = CTMUI" name="" value="0x1" />
         <value caption="Skip CTMUI for input scan; CSSL13 = CTMUI" name="" value="0x0" />
      </value-group>
      <value-group caption="IVREF Pin Scan Selection bits" name="AD1CSSL__CSSL14">
         <value caption="Select IVREF for input scan; CSSL14 = IVREF" name="" value="0x1" />
         <value caption="Skip IVREF for input scan; CSSL14 = IVREF" name="" value="0x0" />
      </value-group>
      <value-group caption="VSS Pin Scan Selection bits" name="AD1CSSL__CSSL15">
         <value caption="Select VSS for input scan; CSSL15 = VSS" name="" value="0x1" />
         <value caption="Skip VSS for input scan; CSSL15 = VSS" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00747" name="BMX" version="1">
      <register-group name="BMX">
         <register caption="Bus Matrix Configuration Register" name="BMXCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Bus Matrix Arbitration Mode bits" mask="0x00000007" name="BMXARB" values="BMXCON__BMXARB" />
            <bitfield caption="CPU Instruction or Data Access from Data RAM Wait State bit" mask="0x00000040" name="BMXWSDRM" values="BMXCON__BMXWSDRM" />
            <bitfield caption="Bus Error from CPU Instruction Access bit" mask="0x00010000" name="BMXERRIS" values="BMXCON__BMXERRIS" />
            <bitfield caption="Bus Error from CPU Data Access bit" mask="0x00020000" name="BMXERRDS" values="BMXCON__BMXERRDS" />
            <bitfield caption="Bus Error from DMA bit" mask="0x00040000" name="BMXERRDMA" values="BMXCON__BMXERRDMA" />
            <bitfield caption="Enable Bus Error from ICD Debug Unit bit" mask="0x00080000" name="BMXERRICD" values="BMXCON__BMXERRICD" />
            <bitfield caption="Enable Bus Error from IXI bit" mask="0x00100000" name="BMXERRIXI" values="BMXCON__BMXERRIXI" />
         </register>
         <register caption="Data RAM Kernel Program Base Address Register" name="BMXDKPBA" offset="0x10" rw="RW" size="4">
            <bitfield caption="DRM Kernel Program Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDKPBA" values="BMXDKPBA__BMXDKPBA" />
         </register>
         <register caption="Data RAM User Data Base Address Register" name="BMXDUDBA" offset="0x20" rw="RW" size="4">
            <bitfield caption="DRM User Data Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDUDBA" values="BMXDUDBA__BMXDUDBA" />
         </register>
